## How to select rows based on column values

In [2]:
import pandas as pd
import numpy as np

In [5]:
raw_data = {'#name': ['Amy', 'Amy','Bob','Bob','Carol','Carol'], 
        '#subject':['Math','History','Math','History','Math','History'],
        '#score': [66,77,88,55,77,99]}
df = pd.DataFrame(raw_data)
df

   #name #subject  #score
0    Amy     Math      66
1    Amy  History      77
2    Bob     Math      88
3    Bob  History      55
4  Carol     Math      77
5  Carol  History      99

### 1.  Equels(or not) to some value

In [7]:
# equal to some value
df.loc[df['#name'] == 'Bob']

  #name #subject  #score
2   Bob     Math      88
3   Bob  History      55

In [22]:
# Not equal to some value
df.loc[df['#name'] != 'Bob']

   #name #subject  #score
0    Amy     Math      66
1    Amy  History      77
4  Carol     Math      77
5  Carol  History      99

### 2.   Value in(or not in) an iterable

In [8]:
# in an iterable
df.loc[df['#subject'].isin(['Math','PE'])]

   #name #subject  #score
0    Amy     Math      66
2    Bob     Math      88
4  Carol     Math      77

In [23]:
# Not in an iterable
df.loc[~df['#subject'].isin(['Math','PE'])]

   #name #subject  #score
1    Amy  History      77
3    Bob  History      55
5  Carol  History      99

### 3. And

In [19]:
# using &
df[(df['#score'] > 70) & (df['#subject'] == 'Math')]

   #name #subject  #score
2    Bob     Math      88
4  Carol     Math      77

### 4. Or

In [26]:
# using |
df[(df['#score'] > 80) | (df['#score'] < 70)]

   #name #subject  #score
0    Amy     Math      66
2    Bob     Math      88
3    Bob  History      55
5  Carol  History      99